Ran Plan for project: `production` dir: `deployment/prod/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_secret_manager_secret.backstage-bits-credentials["auth-github-client-id"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-github-client-id"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-github-client-secret"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-github-client-secret"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-google-client-id"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-google-client-id"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-google-client-secret"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-google-client-secret"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["github-app-backstage-bits-credentials"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "yaml-file"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "yaml-file"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "github-app-backstage-bits-credentials"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "yaml-file"
        }

+       replication {
+           auto {
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p production`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fprod%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p production -- -target=google_secret_manager_secret.backstage-bits-credentials`
</details>
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`